In [1]:
import numpy as np
import pandas as pd

In [2]:
data= pd.read_csv(r"C:\Users\Admin\Desktop\14-12-24\alumni.csv")

In [3]:
data.head()

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
0,2004,Male,Single,Standard Diploma,Yes,125000,10869,"$86,000"
1,2005,Male,Married,College Prep Diploma,No,100000,10869,"$116,000"
2,2006,Female,Single,Standard Diploma,Yes,70000,10869,"$52,000"
3,2007,Male,Married,Standard Diploma,No,120000,10869,"$76,000"
4,2006,Female,Divorced,Standard Diploma,Yes,95000,11948,"$52,000"

In [4]:
print(data.isnull().sum())

Year Graduated    0
Gender            0
Marital Status    0
Diploma Type      0
Defaulted         0
Salary            0
Fee               0
Savings ($)       0
dtype: int64

In [5]:
#There is no null value in the data set

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 88 entries, 0 to 87
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Year Graduated  88 non-null     int64
 1   Gender          88 non-null     object
 2   Marital Status  88 non-null     object
 3   Diploma Type    88 non-null     object
 4   Defaulted       88 non-null     object
 5   Salary          88 non-null     int64
 6   Fee             88 non-null     int64
 7   Savings ($)     88 non-null     object
dtypes: int64(3), object(5)
memory usage: 5.6+ KB

In [12]:
#Gender, Marital status, Diploma type, Defauted and savings are object type data set
#Saving is int data so we need to change the data type of column savings

In [14]:
data['Savings ($)'] = data['Savings ($)'].str.replace(',', '').str.replace('$', '').astype(int)

In [15]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 88 entries, 0 to 87
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Year Graduated  88 non-null     int64
 1   Gender          88 non-null     object
 2   Marital Status  88 non-null     object
 3   Diploma Type    88 non-null     object
 4   Defaulted       88 non-null     object
 5   Salary          88 non-null     int64
 6   Fee             88 non-null     int64
 7   Savings ($)     88 non-null     int32
dtypes: int32(1), int64(3), object(4)
memory usage: 5.3+ KB

In [16]:
data.describe()

       Year Graduated         Salary           Fee    Savings ($)
count       88.000000      88.000000     88.000000      88.000000
mean      2006.477273   84090.909091  11708.727273   47954.545455
std          1.560852   21234.128008   1110.647949   28324.437721
min       2004.000000   35000.000000  10869.000000    6000.000000
25%       2005.000000   75000.000000  10968.000000   30000.000000
50%       2006.500000   75000.000000  11696.000000   46000.000000
75%       2008.000000   90000.000000  12058.250000   67000.000000
max       2009.000000  160000.000000  20960.000000  146000.000000

In [17]:
#The summary statistics for the aluminin data

In [25]:
high_earners = data[data['Salary'] > 110000]
print("\nAlumni earning above $110000:")
print(high_earners)

Alumni earning above $110000:
    Year Graduated Gender Marital Status          Diploma Type Defaulted  \
0             2004   Male         Single      Standard Diploma       Yes
3             2007   Male        Married      Standard Diploma        No
6             2006   Male       Divorced      Standard Diploma        No
18            2006   Male        Married      Standard Diploma        No
31            2006   Male        Married      Standard Diploma       Yes
43            2008   Male        Married  College Prep Diploma        No

    Salary    Fee  Savings ($)
0   125000  10869        86000
3   120000  10869        76000
6   160000  11724       120000
18  140000  20960        72000
31  120000  10962        60000
43  160000  11693        62000

In [28]:
sorted_savings = data.sort_values(by='Savings ($)', ascending=False)
print("\nAlumni sorted by savings (descending):")
print(sorted_savings.head())

Alumni sorted by savings (descending):
    Year Graduated  Gender Marital Status          Diploma Type Defaulted  \
24            2007  Female       Divorced      Standard Diploma        No
6             2006    Male       Divorced      Standard Diploma        No
12            2007    Male         Single      Standard Diploma       Yes
1             2005    Male        Married  College Prep Diploma        No
49            2004  Female        Married      Standard Diploma        No

    Salary    Fee  Savings ($)
24  110000  11691       146000
6   160000  11724       120000
12  110000  12717       120000
1   100000  10869       116000
49  110000  10966       103000

In [30]:
average_salary_by_marital_status = data.groupby('Marital Status')['Salary'].mean()
print("\nAverage salary by marital status:")
print(average_salary_by_marital_status)

Average salary by marital status:
Marital Status
Divorced    86052.631579
Married     85571.428571
Single      81470.588235
Name: Salary, dtype: float64